Public Attributes | List of all members
API_MarkerData Struct Reference
Element Manager
Describes the various parameters of dimension markers. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_MarkerID  | markerType
Marker type.
 short  | markerPen
Pen attribute index for the marker.
 double  | markerSize
In scaled drawing size (in mm).
Detailed Description
Describes the various parameters of dimension markers.